<html>
    <head>
        <meta charset="utf-8">
        <title>Теория: рекурсивная обработка списков</title>
        <link rel="stylesheet" href="css/myStyle.css" type="text/css">
    </head>
    <body>
        <?php
            require_once "help_functions.php";
            printNavigation();        // вывели панель навигации
            printSidebarTheory(5);    // вывели сайдбар для теории
        ?>
        
        <div id="page">
            <br><h1>Рекурсивная обработка списков</h1><br>
            <br><h2>Задачи для самостоятельного решения</h2><br>
            <p>Применяя рекурсию, решить следующие задачи:</p>
            <ol>
                <li>Написать процедуру проверки наличия в списке заданного числа.</li>
                <li>Определить между какими двумя элементами заданного списка находится заданный элемент.</li>
                <li>Найти количество не кратных 3 элементов списка.</li>
                <li>Найти сумму чётных элементов списка.</li>
                <li>Удалить 3-й элемента списка, если он существует.</li>
            </ol>
            
            
            <br>
            <a href="theory5.php">Вернуться к теории</a>
        </div>
        
    </body>
</html>