<html>
    <head>
        <meta charset="utf-8">
        <title>Теория: рекурсивная обработка деревьев</title>
        <link rel="stylesheet" href="css/myStyle.css" type="text/css">
    </head>
    <body>
        <?php
            require_once "help_functions.php";
            printNavigation();        // вывели панель навигации
            printSidebarTheory(6);    // вывели сайдбар для теории
        ?>
        
        <div id="page">
            <br><h1>Рекурсивная обработка деревьев</h1><br>
            <br><h2>Задачи для самостоятельного решения</h2><br>
            <p>Применяя рекурсию, решить следующие задачи:</p>
            <ol>
                <li>Найти сумму чётных элементов дерева.</li>
                <li>Найти количество нечётных листьев дерева.</li>
                <li>Найти количество не кратных 3 внутренних узлов дерева.</li>
                <li>Найти глубину дерева.</li>
                <li>Сгенерировать двоичное дерево поиска для последовательности чисел: 17, 23, 15, 118, 9, 74.</li>
            </ol>
            
            
            <br>
            <a href="theory6.php">Вернуться к теории</a>
        </div>
        
    </body>
</html>